#ifndef DATA_SYMBOLS_H
#define DATA_SYMBOLS_H

#include <inttypes.h>
#include <ultra64.h>

typedef uint32_t UNK_TYPE;
typedef uint32_t UNK_POINTER;

// this is totally bogus
typedef struct {
    uint32_t unk_0x000;
    uint32_t unk_0x004;
    uint32_t unk_0x008;
    uint32_t unk_0x00C;
    uint32_t unk_0x010;
    uint32_t unk_0x014;
    uint32_t unk_0x018;
    uint32_t unk_0x01C;
    uint32_t unk_0x020;
    uint32_t unk_0x024;
    uint32_t unk_0x028;
    uint32_t unk_0x02C;
    uint32_t unk_0x030;
    uint32_t unk_0x034;
    uint32_t unk_0x038;
    uint32_t unk_0x03C;
    uint32_t unk_0x040;
    uint32_t unk_0x044;
    uint32_t unk_0x048;
    uint32_t unk_0x04C;
    uint32_t unk_0x050;
    uint32_t unk_0x054;
    uint32_t unk_0x058;
    uint32_t unk_0x05C;
    uint32_t unk_0x060;
    uint32_t unk_0x064;
    uint32_t unk_0x068;
    uint32_t unk_0x06C;
    uint32_t unk_0x070;
    uint32_t unk_0x074;
    uint32_t unk_0x078;
    uint32_t unk_0x07C;
    uint32_t unk_0x080;
    uint32_t unk_0x084;
    uint32_t unk_0x088;
    uint32_t unk_0x08C;
    uint32_t unk_0x090;
    uint32_t unk_0x094;
    uint32_t unk_0x098;
    uint32_t unk_0x09C;
    uint32_t unk_0x0A0;
    uint32_t unk_0x0A4;
    uint32_t unk_0x0A8;
    uint32_t unk_0x0AC;
    uint32_t unk_0x0B0;
    uint32_t unk_0x0B4;
    uint32_t unk_0x0B8;
    uint32_t unk_0x0BC;
    uint32_t unk_0x0C0;
    uint32_t unk_0x0C4;
    uint32_t unk_0x0C8;
    uint32_t unk_0x0CC;
    uint32_t unk_0x0D0;
    uint32_t unk_0x0D4;
    uint32_t unk_0x0D8;
    uint32_t unk_0x0DC;
    uint32_t unk_0x0E0;
    uint32_t unk_0x0E4;
    uint32_t unk_0x0E8;
    uint32_t unk_0x0EC;
    uint32_t unk_0x0F0;
    uint32_t unk_0x0F4;
    uint32_t unk_0x0F8;
    uint32_t unk_0x0FC;
    uint32_t unk_0x100;
    uint32_t unk_0x104;
    uint32_t unk_0x108;
    uint32_t unk_0x10C;
    uint32_t unk_0x110;
    uint32_t unk_0x114;
    uint32_t unk_0x118;
    uint32_t unk_0x11C;
    uint32_t unk_0x120;
    uint32_t unk_0x124;
    uint32_t unk_0x128;
    uint32_t unk_0x12C;
    uint32_t unk_0x130;
    uint32_t unk_0x134;
    uint32_t unk_0x138;
    uint32_t unk_0x13C;
    uint32_t unk_0x140;
    uint32_t unk_0x144;
    uint32_t unk_0x148;
    uint32_t unk_0x14C;
    uint32_t unk_0x150;
    uint32_t unk_0x154;
    uint32_t unk_0x158;
    uint32_t unk_0x15C;
    uint32_t unk_0x160;
    uint32_t unk_0x164;
    uint32_t unk_0x168;
    uint32_t unk_0x16C;
    uint32_t unk_0x170;
    uint32_t unk_0x174;
    uint32_t unk_0x178;
    uint32_t unk_0x17C;
    uint32_t unk_0x180;
    uint32_t unk_0x184;
    uint32_t unk_0x188;
    uint32_t unk_0x18C;
    uint32_t unk_0x190;
    uint32_t unk_0x194;
    uint32_t unk_0x198;
    uint32_t unk_0x19C;
    uint32_t unk_0x1A0;
    uint32_t unk_0x1A4;
    uint32_t unk_0x1A8;
    uint32_t unk_0x1AC;
    uint32_t unk_0x1B0;
    uint32_t unk_0x1B4;
    uint32_t unk_0x1B8;
    uint32_t unk_0x1BC;
    uint32_t unk_0x1C0;
    uint32_t unk_0x1C4;
    uint32_t unk_0x1C8;
    uint32_t unk_0x1CC;
    uint32_t unk_0x1D0;
    uint32_t unk_0x1D4;
    uint32_t unk_0x1D8;
    uint32_t unk_0x1DC;
    uint32_t unk_0x1E0;
    uint32_t unk_0x1E4;
    uint32_t unk_0x1E8;
    uint32_t unk_0x1EC;
    uint32_t unk_0x1F0;
    uint32_t unk_0x1F4;
    uint32_t unk_0x1F8;
    uint32_t unk_0x1FC;
    uint32_t unk_0x200;
} CFB;

typedef struct {
    /* 0x00 */ int32_t unk_0x00;
    /* 0x04 */ int32_t unk_0x04;
    /* 0x08 */ int32_t unk_0x08;
    /* 0x0C */ int32_t unk_0x0C;
    /* 0x10 */ int32_t unk_0x10;
    /* 0x14 */ int32_t unk_0x14;
    /* 0x18 */ int32_t unk_0x18;
    /* 0x1C */ int32_t unk_0x1C;
    /* 0x20 */ int32_t unk_0x20;
    /* 0x24 */ int32_t unk_0x24;
    /* 0x28 */ int32_t unk_0x28;
    /* 0x2C */ int32_t unk_0x2C;
    /* 0x30 */ int32_t unk_0x30;
    /* 0x34 */ int32_t unk_0x34;
    /* 0x38 */ int32_t unk_0x38;
    /* 0x3C */ int32_t unk_0x3C;
    /* 0x40 */ int32_t unk_0x40;
    /* 0x44 */ int32_t unk_0x44;
} struct_D_8012AD10;

typedef struct {
    uint16_t unk_0x00;
    int8_t unk_0x02;
    int8_t unk_0x03;
    uint8_t unk_0x04;
    uint8_t pad;
} struct_func_80000FE0_temp_v0;

typedef struct {
    uint8_t unk_0x000[0xBC6];
    uint8_t unk_0xBC6;
    uint8_t unk_0xBC7;
} struct_func_800188CC_gActors;

typedef struct {
    uint8_t unk_0x00[0x2880];
    uint16_t unk_0x2880;
    uint16_t unk_0x2882;
    uint8_t unk_0x2884[0x9C];
    uint16_t unk_0x2920;
    uint16_t unk_0x2922;
} struct_func_80021270_D_80104098;

extern UNK_TYPE D_80000300;
extern UNK_TYPE D_800EA110;
extern UNK_TYPE D_800EA500;
extern UNK_TYPE D_800E9850;
extern uint32_t D_80126670; // initial thread stack head
extern UNK_TYPE D_80128670;
extern UNK_TYPE D_80129670;
extern UNK_TYPE D_8012A678;
extern OSThread D_8012A698; // idle
extern OSThread D_8012A848;
extern OSThread D_8012A9F8;
extern UNK_TYPE D_8012AC38;
extern struct_D_8012AD10* D_8012AD08;
extern struct_D_8012AD10 D_8012AD10;
extern UNK_TYPE D_801850B0;
extern UNK_TYPE D_801850B8;
extern uint8_t D_80185518;
extern uint8_t D_80185519;
extern UNK_TYPE D_8018551C;
extern UNK_POINTER D_80185520;
extern UNK_TYPE D_80189A58;
extern OSTask* D_8012AC84;
extern UNK_TYPE D_8012ABA8;
extern UNK_TYPE D_8012AC68;
extern UNK_TYPE D_8012ABD8;
extern UNK_TYPE D_8012AC70;
extern UNK_TYPE D_8012AC80;
extern UNK_TYPE D_8012ABF0;
extern UNK_TYPE D_8012AC74;
extern OSMesgQueue D_8012ABC0;
extern UNK_TYPE D_8012AC6C;
extern uint16_t D_800BE700;
extern UNK_TYPE D_8012ADA0;
extern UNK_TYPE D_8012AD88;
extern UNK_TYPE D_801370C0;
extern UNK_TYPE D_8012AC08;
extern UNK_TYPE D_800BAAB0;
extern UNK_TYPE D_800EEA10;
extern UNK_TYPE D_8011D970;
extern UNK_TYPE D_8011DDF0;
extern UNK_TYPE D_801377D0;
extern UNK_TYPE D_801378C0;
extern int16_t D_800BE668;
extern uint8_t D_800BE6E4;
extern uint8_t D_800BE6E8;
extern uint8_t D_800BE6EC;
extern uint16_t D_800BE514;
extern uint16_t D_800BE518;
extern uint16_t D_800CA238;
extern uint16_t gGameState;
extern uint16_t gGameSubState;
extern UNK_TYPE D_800DD47C;
extern UNK_TYPE D_800DD67C;
extern UNK_TYPE D_800DD87C;
extern UNK_TYPE D_800DCC7C;
extern UNK_TYPE D_800DC67C;
extern UNK_TYPE D_800DC27C;
extern UNK_TYPE D_800DC47C;
extern UNK_TYPE D_800DC87C;
extern UNK_TYPE D_800DCA7C;
extern UNK_TYPE D_800DC07C;
extern UNK_TYPE D_800DB07C;
extern UNK_TYPE D_800DB27C;
extern UNK_TYPE D_800DB47C;
extern UNK_TYPE D_800DB67C;
extern UNK_TYPE D_800DB87C;
extern UNK_TYPE D_800DBA7C;
extern UNK_TYPE D_800DBC7C;
extern UNK_TYPE D_800DFE48;
extern UNK_TYPE D_800E0248;
extern UNK_TYPE D_800E0448;
extern UNK_TYPE D_800E0048;
extern UNK_TYPE D_800DFA48;
extern UNK_TYPE D_800DFC48;
extern UNK_TYPE D_800DF848;
extern UNK_TYPE D_800D9B7C;
extern UNK_TYPE D_800D9E7C;
extern UNK_TYPE D_800D9C7C;
extern UNK_TYPE D_800D9F7C;
extern UNK_TYPE D_800D9D7C;
extern UNK_TYPE D_800C3838;
extern UNK_TYPE D_8016E718;
extern UNK_TYPE D_800C3830;
extern UNK_TYPE D_801377B8;
extern UNK_TYPE D_8016DEB8;
extern UNK_TYPE D_800C3834;
extern OSTask* D_8016E6F0;
extern uint16_t D_800BE500;
extern uint16_t D_800BE504;
extern uint16_t D_800BE508;
extern uint16_t D_800BE50C;
extern uint16_t D_800BE510;
extern uint16_t D_800BE51C;
extern uint16_t D_800BE520;
extern uint16_t D_800BE524;
extern uint16_t D_800BE528;
extern uint16_t D_800BE52C;
extern uint16_t D_800BE530;
extern uint16_t D_800BE534;
extern uint16_t D_801781F8;
extern uint16_t D_800CBF44;
extern uint16_t D_80178136;
extern UNK_TYPE D_801780F0;
extern UNK_TYPE D_801780F4;
extern UNK_TYPE D_8012ADC0;
extern UNK_TYPE D_80130F40;
extern float gEyeX;
extern float gEyeY;
extern float gEyeZ;
extern float gAtX;
extern float gAtY;
extern float gAtZ;
extern float gUpX;
extern float gUpY;
extern float gUpZ;
extern uint16_t D_800BE5D0;
extern uint16_t D_800F4224;
extern uint32_t D_800F4210;
extern uint16_t D_800F423A;
extern uint16_t D_800F423C;
extern uint16_t D_800F423E;
extern uint16_t D_800F4240;
extern UNK_POINTER D_800F430C;
extern UNK_POINTER D_800F4310;
extern UNK_TYPE D_800C9080;
extern UNK_TYPE D_800F42E4;
extern UNK_TYPE D_8016DFE4;
extern uint8_t D_800EF4D0;
extern UNK_TYPE D_801374DC;
extern uint16_t D_800BE4E8;
extern uint16_t D_800BE4E0;
extern uint16_t D_801782B8;
extern uint16_t D_801781E0;
extern uint16_t D_800D28E8;
extern uint16_t D_800D28E4;
extern uint16_t D_800BE6AC;
extern uint16_t D_800BE4FC;
extern uint16_t D_800BE6B4;
extern uint16_t D_801781DC;
extern uint16_t D_800BE4E4;
extern uint16_t D_800CA230;
extern uint8_t D_800EF4F0;
extern uint16_t D_800EF508;
extern uint16_t D_800EF4F8;
extern uint16_t D_800EF500;
extern uint16_t D_800BE4F8;
extern uint16_t D_800BE5D4;
extern UNK_TYPE D_80137458;
extern uint16_t D_800BE4D0;
extern uint16_t D_800BE4D4;
extern int32_t D_800BE5D8;
extern int32_t D_800BE5DC;
extern int16_t D_800BE558;
extern int16_t D_800BE55C;
extern UNK_TYPE D_800BE560;
extern uint16_t D_800BE62C;
extern uint16_t D_800BE630;
extern int32_t D_800BE564;
extern int32_t D_800D28FC;
extern uint16_t D_800D2978;
extern uint16_t D_800BE714;
extern uint16_t D_80178460;
extern uint16_t D_800BE5A4;
extern uint16_t D_800BE6B8;
extern int16_t D_800EF4D2;
extern int16_t D_800EF4D4;
extern uint16_t D_800BE704;
extern uint16_t D_800BE708;
extern uint16_t D_800BE544;
extern uint16_t D_800D2920;
extern uint16_t D_800D2924;
extern uint16_t D_800D2918;
extern uint16_t D_800D291C;
extern uint16_t D_801781C8;
extern uint16_t D_801781CA;
extern uint16_t D_801781CC;
extern uint16_t D_801781CE;
extern uint16_t D_801781D0;
extern uint16_t D_801781D2;
extern uint16_t D_801781D4;
extern struct_func_80000FE0_temp_v0 D_8012AD70[];
extern uint16_t D_801370C4;
extern int8_t D_800BE53C;
extern int8_t D_800BE540;
extern uint16_t D_800BE538;
extern UNK_TYPE D_801378C8;
extern int32_t D_800C4EC4;
extern UNK_TYPE D_800C4EC8;
extern int32_t D_800C4EBC;
extern UNK_TYPE D_800C4EC0;
extern uint64_t D_800C4EAC;
extern int8_t D_800C4EB0;
extern int8_t D_800C4EB4;
extern int8_t D_800C4EB8;
extern UNK_TYPE D_800C4E5C;
extern uint16_t gGameSubState;
extern uint16_t D_80137D90;
extern uint16_t gGameState;
extern uint16_t gGameSubState;
extern UNK_TYPE D_800F026E;
extern UNK_TYPE D_800F0406;
extern UNK_TYPE D_800C94DA;
extern int32_t D_801781A0;
extern uint16_t D_800F4262;
extern uint16_t D_800F4268;
extern uint16_t D_800F4218;
extern uint16_t D_800F421C;
extern UNK_TYPE D_800F42A0;
extern uint16_t D_800F43FA;
extern uint16_t D_800F4400;
extern uint16_t D_800F43B0;
extern uint16_t D_800F43B4;
extern uint16_t D_800F447C;
extern uint16_t D_800F4438;
extern uint16_t D_800F0A66;
extern uint16_t D_800F00D6;
extern uint16_t D_800EF92C;
extern uint16_t D_800EFAC4;
extern uint16_t D_800EF794;
extern uint8_t D_800F46F7;
extern uint8_t D_800F08CE;
extern UNK_TYPE D_800C94CC;
extern int32_t D_801781A1;
extern UNK_TYPE D_800C94D0;
extern uint8_t D_801376BD;
extern uint8_t D_801376B9;
extern uint8_t D_801376A9;
extern uint8_t D_801376AD;
extern uint8_t D_801376B1;
extern uint8_t D_801376B5;
extern UNK_TYPE D_800C823C;
extern UNK_TYPE D_80178188;
extern UNK_TYPE D_80178170;
extern UNK_TYPE D_800C8378;
extern UNK_TYPE D_800C83F8;
extern int16_t D_80178162;
extern UNK_TYPE D_800F0736;
extern UNK_TYPE D_800F059E;
extern uint8_t D_800C5008;
extern int8_t D_80171B18;
extern UNK_TYPE D_800BA9E0;
extern CFB D_803DA800[2];
extern UNK_POINTER D_80178104;
extern UNK_POINTER D_80178108;
extern UNK_POINTER D_8017810C;
extern UNK_POINTER D_80178110;
extern UNK_POINTER D_80178114;
extern UNK_POINTER D_80178118;
extern UNK_POINTER D_8017811C;
extern UNK_POINTER D_80178120;
extern UNK_POINTER D_80178124;
extern UNK_POINTER D_80178128;
extern UNK_TYPE D_802C9F70;
extern int16_t D_80103944;
extern int16_t D_801037AA;
extern int16_t D_80103480;
extern int16_t D_80103616;
extern uint16_t D_800CA234;
extern UNK_TYPE D_80103918;
extern UNK_TYPE D_80103780;
extern UNK_TYPE D_801035E8;
extern UNK_TYPE D_80103450;
extern UNK_TYPE D_800CA2B0;
extern uint16_t D_800D2908;
extern struct_func_80021270_D_80104098 D_80104098;
extern uint16_t D_800CA23C;
extern uint16_t D_800CA240;
extern uint16_t D_800CA248;
extern uint16_t D_800CA24C;
extern uint16_t D_800CA244;
extern uint16_t D_800CA250;
extern uint16_t* D_800CBDFC;
extern uint16_t* D_800CBE0C;
extern uint16_t D_801069B8;
extern uint16_t D_80106918;
extern int8_t D_800BE6F0;
extern int16_t D_800BE63C;
extern int32_t D_800BE6C0;
extern uint8_t D_801376BC;
extern uint8_t D_801376B8;
extern uint16_t D_80137480;
extern int16_t D_800BE6FC;
extern int16_t D_800BE58C;
extern int16_t D_800BE588;
extern uint32_t D_800BE554;
extern uint32_t D_800BE550;
extern UNK_TYPE D_800BE618;
extern UNK_TYPE D_800BE614;
extern UNK_TYPE D_800BE610;
extern UNK_TYPE D_800BE73C;
extern int16_t D_800BE5F0;
extern int32_t D_800BE5EC;
extern int32_t D_800BE5E8;
extern uint16_t D_800BE6A4;
extern uint16_t D_800BE590;
extern uint16_t D_800BE594;
extern uint16_t D_8013747C;
extern uint16_t D_800BE674;
extern uint16_t D_800BE66C;
extern uint16_t D_800D294C;
extern uint16_t D_800D5820;
extern int32_t D_800BE5F4;
extern uint8_t D_801376A8;
extern CFB* D_801373E0; // FIXME: type is wrong, I am reusing this struct
extern uint32_t D_801781F4;
extern uint32_t D_80171B14;
extern uint32_t D_80171B10;
extern UNK_TYPE D_800DE348;
extern UNK_TYPE D_800DE508;
extern UNK_TYPE D_800DE6C8;
extern UNK_TYPE D_800DE888;
extern UNK_TYPE D_800DEA48;
extern UNK_TYPE D_800DEF88;
extern UNK_TYPE D_800DEC08;
extern UNK_TYPE D_800DEDC8;
extern UNK_TYPE D_800DF308;
extern UNK_TYPE D_800DF4C8;
extern UNK_TYPE D_800DF688;
extern UNK_TYPE D_800DF148;
extern UNK_TYPE D_800DDA88;
extern UNK_TYPE D_800DDE08;
extern UNK_TYPE D_800DDC48;
extern UNK_TYPE D_800DDFC8;
extern uint16_t D_800D2968;
extern int16_t D_800D296C;
extern int16_t D_800D2974;
extern int16_t D_800D2970;
extern int32_t D_800D28EC;
extern uint16_t D_800D28F0;
extern int16_t D_800D28F8;
extern int16_t D_800D28F4;
extern int32_t D_800D2938;
extern uint16_t D_801782C0;
extern uint8_t D_801069E0;
extern uint16_t D_800D37A4;
extern int16_t D_800BE568;
extern int32_t D_800D2928;
extern int16_t D_800D2914;
extern int16_t D_800EF5F0;
extern uint8_t D_800D28D0;
extern int16_t D_800BE4EC;
extern int16_t D_800D2900;
extern int32_t D_800D2928;
extern int32_t D_800BE72C;
extern int32_t D_800BE730;
extern int16_t D_800BE578;
extern int16_t D_800BE584;
extern int16_t D_800BE580;
extern int16_t D_800BE6A8;
extern int8_t D_800BE70C;
extern int16_t D_800BE57C;
extern int8_t D_800BE710;
extern int32_t D_800BE71C;
extern int32_t D_800BE720;
extern int32_t D_800BE724;
extern int32_t D_800BE728;
extern int32_t D_800BE638;
extern uint16_t D_800CBF58;
extern int8_t D_800CC428;
extern UNK_POINTER D_8013746C;
extern UNK_TYPE D_800C71A0;
extern uint8_t D_800CCFDC;
extern int32_t D_801376E4;
extern int32_t D_801376E8;
extern int32_t D_800CEC0C;
#endif
