#ifndef UNKNOWN_STRUCTS
#define UNKNOWN_STRUCTS

#include "inttypes.h"

// this is totally bogus
typedef struct {
    uint32_t unk_0x000;
    uint32_t unk_0x004;
    uint32_t unk_0x008;
    uint32_t unk_0x00C;
    uint32_t unk_0x010;
    uint32_t unk_0x014;
    uint32_t unk_0x018;
    uint32_t unk_0x01C;
    uint32_t unk_0x020;
    uint32_t unk_0x024;
    uint32_t unk_0x028;
    uint32_t unk_0x02C;
    uint32_t unk_0x030;
    uint32_t unk_0x034;
    uint32_t unk_0x038;
    uint32_t unk_0x03C;
    uint32_t unk_0x040;
    uint32_t unk_0x044;
    uint32_t unk_0x048;
    uint32_t unk_0x04C;
    uint32_t unk_0x050;
    uint32_t unk_0x054;
    uint32_t unk_0x058;
    uint32_t unk_0x05C;
    uint32_t unk_0x060;
    uint32_t unk_0x064;
    uint32_t unk_0x068;
    uint32_t unk_0x06C;
    uint32_t unk_0x070;
    uint32_t unk_0x074;
    uint32_t unk_0x078;
    uint32_t unk_0x07C;
    uint32_t unk_0x080;
    uint32_t unk_0x084;
    uint32_t unk_0x088;
    uint32_t unk_0x08C;
    uint32_t unk_0x090;
    uint32_t unk_0x094;
    uint32_t unk_0x098;
    uint32_t unk_0x09C;
    uint32_t unk_0x0A0;
    uint32_t unk_0x0A4;
    uint32_t unk_0x0A8;
    uint32_t unk_0x0AC;
    uint32_t unk_0x0B0;
    uint32_t unk_0x0B4;
    uint32_t unk_0x0B8;
    uint32_t unk_0x0BC;
    uint32_t unk_0x0C0;
    uint32_t unk_0x0C4;
    uint32_t unk_0x0C8;
    uint32_t unk_0x0CC;
    uint32_t unk_0x0D0;
    uint32_t unk_0x0D4;
    uint32_t unk_0x0D8;
    uint32_t unk_0x0DC;
    uint32_t unk_0x0E0;
    uint32_t unk_0x0E4;
    uint32_t unk_0x0E8;
    uint32_t unk_0x0EC;
    uint32_t unk_0x0F0;
    uint32_t unk_0x0F4;
    uint32_t unk_0x0F8;
    uint32_t unk_0x0FC;
    uint32_t unk_0x100;
    uint32_t unk_0x104;
    uint32_t unk_0x108;
    uint32_t unk_0x10C;
    uint32_t unk_0x110;
    uint32_t unk_0x114;
    uint32_t unk_0x118;
    uint32_t unk_0x11C;
    uint32_t unk_0x120;
    uint32_t unk_0x124;
    uint32_t unk_0x128;
    uint32_t unk_0x12C;
    uint32_t unk_0x130;
    uint32_t unk_0x134;
    uint32_t unk_0x138;
    uint32_t unk_0x13C;
    uint32_t unk_0x140;
    uint32_t unk_0x144;
    uint32_t unk_0x148;
    uint32_t unk_0x14C;
    uint32_t unk_0x150;
    uint32_t unk_0x154;
    uint32_t unk_0x158;
    uint32_t unk_0x15C;
    uint32_t unk_0x160;
    uint32_t unk_0x164;
    uint32_t unk_0x168;
    uint32_t unk_0x16C;
    uint32_t unk_0x170;
    uint32_t unk_0x174;
    uint32_t unk_0x178;
    uint32_t unk_0x17C;
    uint32_t unk_0x180;
    uint32_t unk_0x184;
    uint32_t unk_0x188;
    uint32_t unk_0x18C;
    uint32_t unk_0x190;
    uint32_t unk_0x194;
    uint32_t unk_0x198;
    uint32_t unk_0x19C;
    uint32_t unk_0x1A0;
    uint32_t unk_0x1A4;
    uint32_t unk_0x1A8;
    uint32_t unk_0x1AC;
    uint32_t unk_0x1B0;
    uint32_t unk_0x1B4;
    uint32_t unk_0x1B8;
    uint32_t unk_0x1BC;
    uint32_t unk_0x1C0;
    uint32_t unk_0x1C4;
    uint32_t unk_0x1C8;
    uint32_t unk_0x1CC;
    uint32_t unk_0x1D0;
    uint32_t unk_0x1D4;
    uint32_t unk_0x1D8;
    uint32_t unk_0x1DC;
    uint32_t unk_0x1E0;
    uint32_t unk_0x1E4;
    uint32_t unk_0x1E8;
    uint32_t unk_0x1EC;
    uint32_t unk_0x1F0;
    uint32_t unk_0x1F4;
    uint32_t unk_0x1F8;
    uint32_t unk_0x1FC;
    uint32_t unk_0x200;
} CFB;

typedef struct {
    /* 0x00 */ int32_t unk_0x00;
    /* 0x04 */ int32_t unk_0x04;
    /* 0x08 */ int32_t unk_0x08;
    /* 0x0C */ int32_t unk_0x0C;
    /* 0x10 */ int32_t unk_0x10;
    /* 0x14 */ int32_t unk_0x14;
    /* 0x18 */ int32_t unk_0x18;
    /* 0x1C */ int32_t unk_0x1C;
    /* 0x20 */ int32_t unk_0x20;
    /* 0x24 */ int32_t unk_0x24;
    /* 0x28 */ int32_t unk_0x28;
    /* 0x2C */ int32_t unk_0x2C;
    /* 0x30 */ int32_t unk_0x30;
    /* 0x34 */ int32_t unk_0x34;
    /* 0x38 */ int32_t unk_0x38;
    /* 0x3C */ int32_t unk_0x3C;
    /* 0x40 */ int32_t unk_0x40;
    /* 0x44 */ int32_t unk_0x44;
} struct_D_8012AD10;

typedef struct {
    uint16_t unk_0x00;
    int8_t unk_0x02;
    int8_t unk_0x03;
    uint8_t unk_0x04;
    uint8_t pad;
} struct_func_80000FE0_temp_v0;

typedef struct {
    uint8_t unk_0x000[0xBC6];
    uint8_t unk_0xBC6;
    uint8_t unk_0xBC7;
} struct_func_800188CC_gActors;

typedef struct {
    uint8_t unk_0x00[0x2880];
    uint16_t unk_0x2880;
    uint16_t unk_0x2882;
    uint8_t unk_0x2884[0x9C];
    uint16_t unk_0x2920;
    uint16_t unk_0x2922;
} struct_func_80021270_D_80104098;

typedef struct {
    uint8_t unk_0x00[0x80];
    uint16_t unk_0x80;
    uint8_t  unk_0x82[0xA];
    uint8_t *unk_0x8C;
} struct_func_80044360_D_801069E0; /* sizeof 0x90 */

typedef struct {
    /* 0x00 */ uint8_t unk_0x00[0x12];
    /* 0x12 */ uint8_t unk_0x12;
    /* 0x13 */ uint8_t unk_0x13;
    /* 0x14 */ uint8_t unk_0x14[0x30];
    /* 0x44 */ uint32_t unk_0x44;
    /* 0x48 */ uint32_t unk_0x48;
    /* 0x4C */ uint32_t unk_0x4C;
    /* 0x50 */ uint32_t unk_0x50;
    /* 0x54 */ uint32_t unk_0x54;
    /* 0x58 */ uint32_t unk_0x58;
    /* 0x5C */ uint32_t unk_0x5C;
    /* 0x60 */ uint32_t unk_0x60;
    /* 0x64 */ uint32_t unk_0x64;
    /* 0x68 */ uint32_t unk_0x68;
    /* 0x6C */ uint32_t unk_0x6C;
    /* 0x70 */ int16_t unk_0x70;
    /* 0x72 */ int16_t unk_0x72;
    /* 0x74 */ uint32_t unk_0x74;
    /* 0x78 */ uint32_t unk_0x78;
    /* 0x7C */ uint32_t unk_0x7C;
} struct_D_801373E0; /* sizeof = unk */

#endif

